app/controllers/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT `feeds`.* FROM `feeds`

  def show
    @feed = Feed.find(params[:id])
---
SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`id` = 1 LIMIT 1

  def edit
    @feed = Feed.find(params[:id])
---
SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`id` = 1 LIMIT 1

  def create
    @feed = Feed.new(params[:feed])

    respond_to do |format|
      if @feed.save
---
INSERT INTO `feeds` (`updated_at`, `url`, `created_at`, `title`) VALUES ('2013-10-01 14:49:16', 'http://feeds.feedburner.com/PaulDixExplainsNothing', '2013-10-01 14:49:16', NULL)